
#* String - str - Строка - Любой набор символов, текста внутри КОВЫЧЕК 
#* Integer - int - Целые числа, отрицательные, или положительные 
#* Float - float - Не целые числа, отрицательные, или положительные, с дробной частью, с ТОЧКОЙ
#* Boolean - bool - Булевые значения, их только два True и False

name = "Bekzat" # String (str) строка - текстовые данные, ВСЕГДА В КОВЫЧКАХ
age = 22  # Integer (int) - целое число, 1, 2, 3, -1, -2, -3, и т.д БЕЗ КОВЫЧЕК и БЕЗ ТОЧКИ
height = 1.83 # float - числа с дробной частью, 3.14, 1.5, -271.1, ОБЯЗАТЕЛЬНО С ТОЧКОЙ
is_student = False   # bool булевое значение - "Истина" или "Ложь", "Да" или "НЕТ", "Пойду" или "Не пойду", "Пароль виден" или "Пароль не виден". Здесь "Ложь", т.к я не студент:)
is_teacher = True  # bool булевое значение - здесь "Истина" т.к я преподаватель

#! Для строк можно использовать: одинарные, двойные и даже тройные ковычки:
#! Одинарные или двойные - решаешь ты, как тебе удобно
#! Тройные мы используем чтобы писать ДЛИННЫЕ, МНОГОСТРОЧНЫЕ переменные String (строки)

name_double_quote = "Bekzat"
name_single_quote = 'Bekzat'
looooooong_name = '''Bekzativolostoromaquenzoromeo
lastingoeirwopxcighkvm
lkwjqcmvlalskdve
vnoemwcppmcmlwci
joiwaksdfk
mnvoiehopwksjhcvw'''


#! Любой ТЕКСТ, НАБОР СИМВОЛОВ внутри кавычек - это СТРОКА, даже если это число
strange_name = '718'
number = 718
#! strange_name не равняется с number, они разные типы данных

int_number = 10 #! Это целое число, у него нет дробной части
float_number = 10.0 #! Из-за точки после 10 ЭТО ДРОБНОЕ ЧИСЛО


