
#* ПЕРЕМЕННЫЕ - это просто КОРОБКИ ХРАНЕНИЯ 
#* ЧТО они хранят? ДАННЫЕ, Информацию
#* Как их создавать и различать? НУЖНО ДАТЬ НАЗВАНИЕ 
#* Какие есть ПРАВИЛА ИМЕНОВАНИЯ коробок (переменных)


#* Правила именования коробок, ПЕРЕМЕННЫХ:
#? 1) Имя должно быть осмысленным: 

#! ПЛОХО: x = "Bekzat"
#* ХОРОШО: name = "Bekzat"

#? 2) Только буквы, цифры(c них не начинаем, но можем их включать) и знаки подчёркивания

#! ПЛОХО:  1person+height
#* ХОРОШО: person1_height

#? 3) Регистр важен
#! Weight и weight - это разные переменные

#? 4) Без пробелов
#! Плохо: my name = "Bekzat"
#* ХОРОШО: my_name = "Bekzat"

#? 5) Не используйте зарезервированные слова
#! Плохо: if, True, False, for, in, range, print, while, def
#* ХОРОШО: my_if = True

