'''
Представьте, что вы работаете в стартапе, и вам нужно отправить 200 электронных писем c предложением c сотрудничестве.
Вместо того чтобы отправлять каждое письмо по отдельности, вы хотите быстро разослать их всем вашим потенциальным клиентам.
Вот тут и приходят на помощь циклы!
Они позволяют вам повторять одно и то же действие — отправку писем — пока не закончатся все адресаты или письма.

'''

'''
Зачем нам нужны циклы?

Экономия времени: Циклы помогают быстро выполнять одно и то же действие много раз.
Автоматизация: Вам не нужно писать один и тот же код снова и снова.
'''