
#* Функция — это как кормить кота. Ты даёшь ему еду, 
#* и он её ест. Кот сам не может взять еду, 
#* тебе нужно вручную передать ему корм. То есть ты 
#* применяешь функцию к объекту (коту).

#* Например:

#* кормить(кот) — это как вызвать функцию len("Привет"). В 
#* этом случае функция берёт объект (кот или строку) 
#* и что-то делает с ним.

#* Метод — это когда кот сам делает что-то. Например, 
#* кот умеет мурлыкать или махать хвостом, и ты просто 
#* даёшь ему команду: "мурлыкай!". Кот знает, как это 
#* делать, потому что это его внутренняя способность.

#* Например:

#* кот.мурлыкай() — это как строка.upper(). В этом случае метод 
#* вызывается на объекте (на коте или строке), и он 
#* выполняет действие.
